Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # aws_iam_policy.policy_ec2tag will be destroyed
  # (because aws_iam_policy.policy_ec2tag is not in configuration)
- resource "aws_iam_policy" "policy_ec2tag" {
      - arn              = "arn:aws:iam::390402544450:policy/poc-ssm-ec2tagging-policy" -> null
      - attachment_count = 0 -> null
      - description      = "allow ec2 tagging for SSM poc" -> null
      - id               = "arn:aws:iam::390402544450:policy/poc-ssm-ec2tagging-policy" -> null
      - name             = "poc-ssm-ec2tagging-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:*",
                          - "ec2:Describe*",
                          - "ec2:CreateTag",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAVVZOOCNBD3OPBCVRK" -> null
      - tags_all         = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "wrestleutopia"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.attach_passrole will be destroyed
  # (because aws_iam_role_policy_attachment.attach_passrole is not in configuration)
- resource "aws_iam_role_policy_attachment" "attach_passrole" {
      - id         = "SSMAutomationRole-20250320041057812500000002" -> null
      - policy_arn = "arn:aws:iam::390402544450:policy/poc-ssm-ec2tagging-policy" -> null
      - role       = "SSMAutomationRole" -> null
    }

  # aws_ssm_association.attach_policy_scheduled will be created
+ resource "aws_ssm_association" "attach_policy_scheduled" {
      + apply_only_at_cron_interval = false
      + arn                         = (known after apply)
      + association_id              = (known after apply)
      + association_name            = "AttachPolicyAutomation"
      + document_version            = (known after apply)
      + id                          = (known after apply)
      + name                        = "AttachSFNResourcePolicy"
      + parameters                  = {
          + "AutomationAssumeRole" = "arn:aws:iam::390402544450:role/SSMAutomationRole"
          + "PolicyJson"           = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "states:StartExecution"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = [
                                  + "arn:aws:iam::825765422855:role/sharedservices_lambda_role",
                                  + "arn:aws:iam::825765422855:role/CrossAccountStartExecutionRole",
                                ]
                            }
                          + Resource  = "aws_sfn_state_machine.manual_workflow.arn"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
          + "ResourceArn"          = "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow"
        }
      + schedule_expression         = "rate(12 hours)"
      + tags_all                    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }

      + targets (known after apply)
    }

  # aws_ssm_document.attach_sfn_policy will be updated in-place
~ resource "aws_ssm_document" "attach_sfn_policy" {
      ~ content          = jsonencode(
          ~ {
              + assumeRole    = "{{AutomationAssumeRole}}"
                # (4 unchanged attributes hidden)
            }
        )
      ~ default_version  = "6" -> (known after apply)
      ~ document_version = "6" -> (known after apply)
      ~ hash             = "d0d876ea23affbd88237eca6cc19fe4f4e7432b6cf6add21f7134e69212408af" -> (known after apply)
        id               = "AttachSFNResourcePolicy"
      ~ latest_version   = "6" -> (known after apply)
        name             = "AttachSFNResourcePolicy"
      ~ parameter        = [
          - {
              - description   = "The ARN of the Step Functions state machine or resource."
              - name          = "ResourceArn"
              - type          = "String"
                # (1 unchanged attribute hidden)
            },
          - {
              - description   = "The JSON representing the resource policy."
              - name          = "PolicyJson"
              - type          = "String"
                # (1 unchanged attribute hidden)
            },
          - {
              - description   = "(Recommended) The IAM role the runbook will assume. If omitted, the runbook will use the credentials of the user or service calling the runbook."
              - name          = "AutomationAssumeRole"
              - type          = "String"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        tags             = {}
        # (14 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 1 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```